<template>
  <div class="container">
    <main class="row">
      <section class="col-12">
        <img src="../assets/logo.svg" alt="" width="200" height="200"><br>
        <div class="source">
          <a href="https://www.cwb.gov.tw/V8/C/">🌐資料來源：參考中央氣象局網站之內容</a>
        </div>
      </section>
      <section class="col-12 col-lg-6">
        <h4>天氣現象 🌤</h4>
        <QQaa v-for="item in weatherQA" v-bind:key="item.id" v-bind:qaTitle="item.qaTitle"
          v-bind:qaAnswer="item.qaAnswer" />
      </section>
      <section class="col-12 col-lg-6">
        <h4>什麼是人工增雨 🌧</h4>
        <QQaa v-for="item in rainmakingQA" v-bind:key="item.id" v-bind:qaTitle="item.qaTitle"
          v-bind:qaAnswer="item.qaAnswer" />
      </section>
    </main>
  </div>
</template>

<script>
import QQaa from "../components/QQaa.vue";

export default {
  components: {
    QQaa,
  },
  data() {
    return {
      weatherQA: [
        {
          id: 1,
          qaTitle: "焚風",
          qaAnswer: "焚風為一種出現在山脈背風面之乾熱風。焚風發生的原因係因與山脈走向垂直之氣流，受到高山阻擋，被迫抬升而冷卻(空氣每上升100公尺氣溫約下降攝氏 0.65度)，空氣中的水氣因而在迎風面上空凝結成雲降雨，待氣流翻越過山嶺，在背風面下降時，已變成乾燥空氣，此時因空氣被壓縮而增溫(每下降100公尺氣溫就上升攝氏１度)。",
        },
        {
          id: 2,
          qaTitle: "颱風",
          qaAnswer: "颱風是一種熱帶氣旋，也就是在熱帶海洋上所發生的低氣壓。至於颱風這個名詞的來源，一般都說是從廣東話「大風」演變而來；但據考證，可能是從台語「風篩」演變而來，因「台語篩同台加風作颱」，至今台語稱颱風為風颱，所以此一說法頗為可信。但無論「大風」也好，「風篩」也好，總之颱風就是在熱帶海洋上發生的一種非常猛烈的風暴。",
        },
        {
          id: 3,
          qaTitle: "冰雹",
          qaAnswer: "冰雹是在對流雲中形成，當水氣隨氣流上升遇冷會凝結成小水滴，若隨著高度增加溫度繼續降低，達到攝氏零度以下時，水滴就凝結成冰粒，在它上升運動過程中，並會吸附其周圍小冰粒或水滴而長大，直到其重量無法為上升氣流所承載時即往下降，當其降落至較高溫度區時，其表面會融解成水，同時亦會吸附周圍之小水滴，此時若又遇強大之上升氣流再被抬升，其表面則又凝結成冰，如此反覆進行如滾雪球般其體積越來越大，直到它的重量大於空氣之浮力，即往下降落，若達地面時未融解成水仍呈固態冰粒者稱為冰雹，如融解成水就是我們平常所見的雨。",
        },
        {
          id: 4,
          qaTitle: "霾 (haze)",
          qaAnswer: "霾 (haze) 在氣象上是指懸浮於空氣中之塵埃或鹽類等非吸水性固體微粒，由於其質點極為細微，致肉眼無法辨識。霾在大氣中多呈乳白色，惟對遠地明亮之背景，則成黃色或橘紅色；反之，對較陰暗之背景，則顯示淡藍色，此乃霾質點所產生之光學效應所致，亦即光線被霾質點散射之緣故。",
        },
        {
          id: 5,
          qaTitle: "海陸風",
          qaAnswer: "海面和陸上的溫度，除了隨季節而變化外，晝夜之間也有類似的變化，但是它的規模很小，影響祗限於沿海附近。靠近海岸的地方，白天的陸地比海洋暖，於是陸地上的氣壓要比海上低，所以白天常常有風從海上吹向陸地，稱為「海風」，入晚之後，情形正好相反，於是風自陸地吹向海洋，稱為「陸風」。",
        },
        {
          id: 6,
          qaTitle: "山風和谷風",
          qaAnswer: "山風和谷風是山嶺地區因為山頂和山谷一日當中熱效應不同所引起。白晝時，在山坡地區由於受太陽照射，溫度較高，空氣膨脹，氣壓降低，因此空氣由山谷沿山坡爬昇，而產生谷風。午前十時左右，風由谷內沿山坡而上，溫度愈高，風勢愈強，到午後二時左右，風力最大，可達 3級，以後逐漸減弱，日落前後完全停止；到晚上，山坡地帶因地勢較高，散熱較快，於是氣溫迅速降低，冷空氣自山頂沿山坡下降，流入谷內，形成山風。",
        },
      ],
      rainmakingQA: [
        {
          id: 1,
          qaTitle: "人工增雨之原理",
          qaAnswer: "在對流層裡，大氣溫度隨高度增加而下降，因此形成雲所在的高度越高則溫度愈低，高度愈低則溫度越高。雲的溫度高於0℃時稱為暖雲，低於0℃時稱為冷雲。在暖雲裡，小水滴經由碰撞與合併過程，變成大水滴，終至克服雲內浮力而掉離雲底，成為地面上的降雨。同樣的，在冷雲中，冰晶成長至能克服雲內浮力時而掉離雲底，在降落過程中經過0℃高度時，融解為水滴，亦成為地面上降雨。當雲內水滴太小或缺乏冰晶而無法降雨時，我們利用人工方法去產生冰晶或使小水滴長大，促使其產生降雨現象，稱為人工增雨。暖雲造雨方法很多，如在雲中噴灑水滴、吸濕性藥粉與液體（氯化鈉）等，透過碰撞與合併過程使水滴成長，終至降落成雨。冷雲造雨方法亦多，但最常使用乾冰或碘化銀，此主要乃因為乾冰溫度為-78℃，在缺乏冰晶的冷雲內，撒播乾冰使其溫度驟降，因而不必藉助冰晶核的情況下，將過冷水滴轉變成冰晶，透過冰晶成長過程終至成雨。碘化銀為非常有效的冰晶核，在冷雲內缺乏冰晶的情況下加入碘化銀充當冰晶核，可促使-5℃以下的水滴凝固為冰晶，再藉由水滴與冰晶共存時的冰晶成長過程而形成降雨。",
        },
        {
          id: 2,
          qaTitle: "人工增雨實施方式一 - 地面造雨法",
          qaAnswer: "人工增雨理論基礎為在雲中撒播人工之雲種，使降雨機會及降雨量增加。所以應選擇適當之氣象條件，撒播人造冰晶核至雲中，加強結核效率，促使降雨發生，一般可分為地面造雨與空中造雨兩種方法。利用地面造雨器燃燒碘化銀溶液，使碘化銀煙粒隨熱氣飄升達高空以充當冰晶核。當碘化銀煙粒上達雲內過冷水滴層，可使過冷水滴凝固為冰晶，經由冰晶成長過程，終至掉落成雨。",
        },
        {
          id: 3,
          qaTitle: "人工增雨實施方式一 - 空中造雨法",
          qaAnswer: "利用飛機在雲中撒播碘化銀或乾冰雲種，由於撒播之雲種可精確被送達足夠低溫之雲中，故一般造雨效果比地面造雨法為佳。",
        },
        {
          id: 4,
          qaTitle: "人工增雨的成效如何",
          qaAnswer: "根據氣象研究人員多年來各種人工增雨試驗累積經驗評估顯示，經由長期規劃實施地面燃燒碘化銀溶液之人工增雨方式，平均約可增加10%降雨；若使用空中造雨方式，於適當的對流性雷雨胞內撒播碘化銀，平均約可增加20%降雨。然而人工增雨之成效，仍受各地區氣象條件、執行技術及行政配合等綜合因素影響，而呈現某些不確定性。",
        },
      ],
    }
  },
}
</script>


<style scoped>
section {
  margin-top: 1rem;
  text-align: center;
}

h4 {
  font-weight: bold;
}

a {
  color: rgb(126, 198, 243);
  font-size: 14px;
  font-weight: bold;
}

a:hover {
  color: rgb(82, 82, 185);
  font-size: 14px;
}

.source {
  text-align: right;
}
</style>
  